export const MENU_ITEMS = [
  {
    title: "Бидний тухай",
    value: "Бидний тухай",
    href: "#about-us",
  },
  {
    title: "Үзлэг, Эмчилгээ",
    value: "Үзлэг, Эмчилгээ",
    href: "#services",
  },
  {
    title: "Эмч нар",
    value: "Эмч нар",
    href: "#doctors",
  },
  {
    title: "Холбоо барих",
    value: "Холбоо барих",
    href: "#contact-us",
  },
  {
    title: "Хүний нөөц",
    value: "Хүний нөөц",
    href: "/human-resource",
  },
];

import { MapPin, Phone, Mail, Clock, Baby, House, Clock2, HeartPulse, TestTube, Radiation, Droplet, Sparkles, Bone, Bug, Pill, FlaskRound, FlaskConical, Worm } from "lucide-react";

export const CONTACT_INFO = [
  {
    icon: MapPin,
    title:
      "Хаяг: БЗД 26-р хороо, Кристал таун хотхоны баруун урд талд HCC төв 3-р давхарт",
    href: "https://www.google.com/maps/place/ENTO+clinic/@47.9045084,106.9387123,310m/data=!3m2!1e3!4b1!4m6!3m5!1s0x5d96930054b6bccb:0xd921b38a885f024b!8m2!3d47.9045084!4d106.9399998!16s%2Fg%2F11xds6dr7_?entry=ttu&g_ep=EgoyMDI1MDkyNC4wIKXMDSoASAFQAw%3D%3D",
  },
  {
    icon: Phone,
    title: "Утас: +72009898",
    href: "tel:+97672009898",
  },
  {
    icon: Mail,
    title: "И-мэйл: info@entoclinic.mn",
    href: "https://mail.google.com/mail/?view=cm&fs=1&to=info@entoclinic.mn&su=Санал%20хүсэлт&body=Сайн%20байна%20уу,",
  },
];

export const RESULT_SM_INFO = [
  {
    icon: Baby,
    title: "Төрсөнөөс 72 цагаас хойш насанд хүртэлх",
  },
  {
    icon: House,
    title: "Гэр бүл, Албан байгууллага, Хамт олон",
  },
  {
    icon: Clock2,
    title: "Хялбар цаг захиалга",
  },
];

export const TITLE_CENTER_INFO = [
  {
    title: "Энто Клиник ХХК",
    text: "“ЭНТО Клиник” эмнэлэг нь халдвар хамгааллын шаардлага, агаар сэлгэлт болон халдваргүйтгэлийн стандартыг бүрэн хангасан, орчин үеийн эмнэлгийн зориулалттай байранд үйл ажиллагаа явуулдаг эрүүл мэндийн цогц үйлчилгээний төв юм. Бид үйлчлүүлэгчдийн тав тух, сэтгэл ханамжийг нэн тэргүүнд тавьж, олон улсын стандартад нийцсэн эмнэлгийн болон лабораторийн тоног төхөөрөмжөөр бүрэн тоноглогдсон орчинд оношилгоо, эмчилгээ, зөвлөгөө, урьдчилан сэргийлэх эмнэлгийн тусламж үйлчилгээг нэг дороос хүргэдэг. Орчин үеийн завгүй амьдралын хэмнэлд нийцүүлэн, гэр бүлийн гишүүн бүрт зориулсан эрүүл мэндийн цогц үйлчилгээг үзүүлэхийн зэрэгцээ клиник болон академик түвшний олон жилийн туршлагатай, чадварлаг эмч, эмнэлгийн мэргэжилтнүүдээр хүний нөөцөө бүрдүүлсэн нь манай эмнэлгийн хамгийн том давуу тал юм. Бид хүүхэд, дотор, уламжлалт, лаборатори, эхо оношилгоо болон өдрийн эмчилгээний тусламж үйлчилгээг мэргэжлийн өндөр түвшинд үзүүлж, бүх насны үйлчлүүлэгч, байгууллага, хамт олон, гэр бүлийн гишүүн бүрийн нас, бие, хувь хүний онцлогт тохирсон урьдчилан сэргийлэх багц болон эмчилгээ үйлчилгээг танд санал болгож байна.",
  },
  {
    title: "Оношлогооны Цогц Үйлчилгээ",
    text: "Нарийвчилсан оношилгоо, эмчилгээг төлөвлөхөд хамгийн сүүлийн үеийн тоног төхөөрөмж, батлагдсан арга зүйг ашиглан эмнэлгийн дэвшилтэт шинжилгээ, мэргэжилтнүүдийн зөвлөгөө.",
  },
  {
    title: "Манай Оношлогооны Мэргэжилтнүүдтэй Уулзана уу",
    text: "Нарийн мэргэжлийн мэргэшсэн эмч, сувилагч нарын баг орчин үеийн дэвшилтэт техник технологийн тусламжтайгаар чанар стандартад нийцсэн эрүүл мэндийн тусламж үйлчилгээг үзүүлж байна.",
  },
  {
    title: "Зөвлөгөөний Хуваарь Гарга",
    text: "Мэргэшсэн эмчийн зөвлөгөө, нарийн оношилгооны шинжилгээг аваарай. Манай мэргэжилтнүүд танд цогц тусламж үзүүлэхэд бэлэн байна.",
  },
  {
    title: "Хүний нөөц",
    text: "Мэргэшсэн эмчийн зөвлөгөө, нарийн оношилгооны шинжилгээг аваарай. Манай мэргэжилтнүүд танд цогц тусламж үзүүлэхэд бэлэн байна.",
  },
];

import { Microscope } from "lucide-react";

export const DIAGNOSTIC_SERVICES = [
    {
    icon: FlaskRound,
    title: "Бамбай булчирхайн үйл ажиллагаа",
    features: [
      "Чөлөөт Т3",
      "Чөлөөт Т4",
      "Бамбай идэвхжүүлэгч даавар",
      "Тиреоглобулины эсрэг бие",
      "Тиреод пероксидаза эсрэг бие"
    ],
  },

  {
    icon: TestTube,
    title: "Шээсний шинжилгээ ",
    features: [
      "Шээсний ерөнхий шинжилгээ",
      "Шээсний тунадасны шинжилгээ",
      "Бөөрний үйл ажиллагаа NGAL",
      "Holter Monitoring",
    ],
  },
  {
    icon: FlaskConical,
    title: "Биохимийн шинжилгээ",
    features: [
      "Эрдсийн багц+бөөрний үйл ажиллагаа",
      "Үрэвслийн уурагтай багц",
      "Таван цул эрхтэний үйл ажиллагааны багц",
      "3 сарын сахарын дундаж HbA1c - Глюкозжсон гемоглобинн гемоглобин",
      "Элэгний үйл ажиллагааны багц",
    ],
  },
  {
    icon: Radiation,
    title: "Хавдрын маркерын шинжилгээ",
    features: [
      "Элэгний хавдрын маркер",
      "Хөхний хавдрын маркер",
      "Өндгөвчний хавдрын маркер",
      "Нойр булчирхайн хавдрын маркер",
      "Ходоодны  хавдрын маркер",
      "Бүдүүн шулуун гэдэсний хавдрын маркер",
    ],
  },
  {
    icon: Droplet,
    title: "Цусны дэлгэрэнгүй шинжилгээ",
    features: [
      "Цусны дэлгэрэнгүй шинжилгээ",
      "Цус бүлэгнэлтийн багц шинжилгээ",
      "Д-Димер",
    ],
  },
 
  {
    icon: Sparkles,
    title: "Дааврын шинжилгээ",
    features: [
      "Эстрадиол",
      "Жирэмсний ХГ",
      "Прогестерон",
      "Тестостерон",
    ],
  },
  {
    icon: HeartPulse,
    title: "Зүрхний үйл ажиллагааны шинжилгээ",
    features: [
      "Зүрхний шигдээсийн маркер",
      "Креатин киназа, зүрхний изофермент",
      "Зүрхний дутагдлын маркер",
    ],
  },

  {
    icon: Microscope,
    title: "Сериологийн шинжилгээ",
    features: [
      "ХДХВ /түргэвчилсэн/",
      "Тэмбүү /түргэвчилсэн/",
      "Томуу Flu A+B /түргэвчилсэн/",
    ],
  },
  {
    icon: Bone,
    title: "Үе мөчний шинжилгээ",
    features: [
      "Ц урвалжит уураг",
      "Үе мөчний үрэвслийн багц /түргэвчилсэн/",
    ],
  },
  {
    icon: Bug,
    title: "Хеликобактери",
    features: [
      "ЭстрХеликобактери тооолох /өтгөнд/адиол",
    ],
  },
  {
    icon: Microscope,
    title: "Бактериологийн шинжилгээ",
    features: [
      "Цагаан хорхойн шинжилгээ",
    ],
  },
   {
    icon: Pill,
    title: "ВИТАМИН, ЭРДЭС, МИКРОЭЛЕМЕНТ",
    features: [
      "Эрдсийн багц",
      "Витамин Д тодорхойлох шинжилгээ ",
    ],
  },
  {
    icon: Worm,
    title: "Элэгний вирусын маркер илрүүлэх шинжилгээ ",
    features: [
      "Элэгний В вирус /анализатор/",
      "Элэгний В вирус /түргэвчилсэн/",
      "Элэгний С вирус /түргэвчилсэн/",
    ],
  },
];

import { Expert } from "../types/experts";
import Doctor1 from "./Odontuya.jpg";
import Doctor2 from "./Oyungerel.jpg";
import Doctor3 from "./Tungalag.png";
import Doctor4 from "./Amgalan.png";
import Doctor5 from "./Sambuu.jpg";

export const CONSULTATION_EXPERTS: Expert[] = [
  {
    name: "Д.ОДОНТУЯА эмч",
    experience: "Ажлын тушлага 42+",
    image: Doctor1,
    credentials:
      "АУ-ны  Доктор, Профессор, Зөвлөх эмч, МУ-ын эрүүлийг хамгаалахын гавьяат ажилтан",
    expertise: [
      "Үе мөчний өвчлөлүүд",
      "Зүрх судас- Дотоод шүүрэл",
      "Мэдрэлийн өвчин",
      "Хүүхдийн үзлэг, эмчилгээ",
      "Хөнгөвчлөхийн өвчний үзлэг эмчилгээ",
    ],
  },
  {
    name: "Р.ОЮУНГЭРЭЛ эмч",
    experience: "Ажлын тушлага 36+",
    image: Doctor2,
    credentials: "АУ-ны  Доктор, Дэд профессор, Зөвлөх эмч",
    expertise: ["Дотор", "Хүүхэд", "Халдварт өвч"],
  },
  {
    name: "Л.ТУНГАЛАГ эмч",
    experience: "Ажлын тушлага 31+",
    image: Doctor3,
    credentials: "АУ-ны  Доктор, Профессор, Хүүхдийн зөвлөх эмч",
    expertise: [
      "Нярайн өвөрмөц асаргаа, сувилал",
      "Нярайн асаргаа, хоололт",
      "Өсөлт хөгжил",
    ],
  },
  {
    name: "Б.АМГАЛАН эмч",
    experience: "Ажлын тушлага 23+",
    image: Doctor4,
    credentials: "АУ-ны  Доктор, Профессор, Зөвлөх эмч",
    expertise: ["Хүүхдийн мэдрэл", "Хүүхдийн сэтгэц", "Нярай"],
  },
  {
    name: "П.САМБУУЖАНЦАН эмч",
    experience: "Ажлын тушлага 33+",
    image: Doctor5,
    credentials: "Тэргүүлэх зэргийн эмч, клиникийн профессор",
    expertise: ["Зүрх судас", "Үе мөч", "Дотрын өвчлөлүүд"],
  },
];

export const CONTACTUS_CARD = [
  {
    icon: Phone,
    title: "Утас",
    text1: "Main: 7200-9898; 8888-6586",
    text2: "И-мэйл: info@entoclinic.mn",
  },
  {
    icon: MapPin,
    title: "Манай клиникийг зориорой",
    text1:
      "ЭНТО Клиник эмнэлэг БЗД, 26-р хороо, Хүннү гудамж, Кристал тауны замын урд талд,  HCC төвийн 3 давхарт 303,306 тоот",
  },
  {
    icon: Clock,
    title: "Цаг",
    text1: "Дав-Бям: 8:00 - 17:00",
    text2: "Бям: 9:00 - 15:00",
    text3: "Ням: Амарна",
  },
];
