export const MENU_ITEMS = [
  {
    title: "Эхлэл",
    value: "Эхлэл",
    href: "/",
  },
  {
    title: "Бидний тухай",
    value: "Бидний тухай",
    href: "#about-us",
  },
  {
    title: "Үзлэг, Эмчилгээ",
    value: "Үзлэг, Эмчилгээ",
    href: "#service",
    isDropdown: true,
    items: [
      { title: "Уламжилалт", href: "/service/traditional-medicine" },
      { title: "Lab", href: "/service/lab" },
      { title: "Хүүхэд", href: "/service/child-medicine" },
    ],
  },
  {
    title: "Эмч нар",
    value: "Эмч нар",
    href: "#doctors",
  },
  {
    title: "Холбоо барих",
    value: "Холбоо барих",
    href: "#contact-us",
  },
];

import {
  MapPin,
  Phone,
  Mail,
  Clock,
  Baby,
  HeartPulse,
  TestTube,
  Radiation,
  Droplet,
  Sparkles,
  Bone,
  Bug,
  Pill,
  FlaskRound,
  FlaskConical,
  Worm,
  Users,
  HandHeart,
  ShieldCheck,
  House,
  ThumbsUp,
  Cross,
} from "lucide-react";

export const CONTACT_INFO = [
  {
    icon: MapPin,
    title:
      "Хаяг: БЗД 26-р хороо, Кристал таун хотхоны баруун урд талд HCC төв 3-р давхарт",
    href: "https://www.google.com/maps/place/ENTO+clinic/@47.9045084,106.9387123,310m/data=!3m2!1e3!4b1!4m6!3m5!1s0x5d96930054b6bccb:0xd921b38a885f024b!8m2!3d47.9045084!4d106.9399998!16s%2Fg%2F11xds6dr7_?entry=ttu&g_ep=EgoyMDI1MDkyNC4wIKXMDSoASAFQAw%3D%3D",
  },
  {
    icon: Phone,
    title: "Утас: +72009898",
    href: "tel:+97672009898",
  },
  {
    icon: Mail,
    title: "И-мэйл: info@entoclinic.mn",
    href: "https://mail.google.com/mail/?view=cm&fs=1&to=info@entoclinic.mn&su=Санал%20хүсэлт&body=Сайн%20байна%20уу,",
  },
];

export const RESULT_SM_INFO = [
  {
    icon: Users,
    title: "Багийн ажиллагаа",
  },
  {
    icon: HandHeart,
    title: "Өөриймсөг хандлага",
  },
  {
    icon: ShieldCheck,
    title: "Чанарыг эрхэмлэнэ",
  },
];

export const SM_INFO_DATA = [
  {
    icon: Baby,
    text: "Хүүхдийг төрсөнөөс 72 цагаас хойш насанд хүртэлх бүх үзлэг, зөвлөгөө, эмчийн хяналтыг хийх боломжтой.",
  },
  {
    icon: House,
    text: "Хувь хүн, гэр бүл, албан байгууллага, хамт олны өвөрмөц хэрэгцээнд тохирсон, урьдчилан сэргийлэх үзлэгийн багц оношилгоо, шинжилгээнд хамруулах боломжтой.",
  },
  {
    icon: ThumbsUp,
    text: "Өвөрмонголын зүү эмчилгээний нарийн схем бүхий эмчилгээтэй.",
  },
  {
    icon: Clock,
    text: "Үзлэгийн цагийг утсаар, онлайнаар, биечлэн авах нөхцөл бүрдсэн ба шинжилгээний хариуг тухай бүрт нь мэйлээр болон аппликейшн ашиглан авах боломжтой.",
  },
];

export const TITLE_CENTER_INFO = [
  {
    title: "Манай эмнэлэгийн үйлчилгээнүүд",
    text: "Нарийвчилсан оношилгоо, эмчилгээг төлөвлөхөд хамгийн сүүлийн үеийн тоног төхөөрөмж, батлагдсан арга зүйг ашиглан эмнэлгийн дэвшилтэт шинжилгээ, мэргэжилтнүүдийн зөвлөгөө.",
  },
  {
    title: "Манай оношилгооны мэргэжилтнүүд",
    text: "Нарийн мэргэжлийн мэргэшсэн эмч, сувилагч нарын баг орчин үеийн дэвшилтэт техник технологийн тусламжтайгаар чанар стандартад нийцсэн эрүүл мэндийн тусламж үйлчилгээг үзүүлж байна.",
  },
  {
    title: "Зөвлөгөөний хуваарь гаргаарай",
    text: "Мэргэшсэн эмчийн зөвлөгөө, нарийн оношилгооны шинжилгээг аваарай. Манай мэргэжилтнүүд танд цогц тусламж үзүүлэхэд бэлэн байна.",
  },
  {
    title: "Хүний нөөц",
    text: "Мэргэшсэн эмчийн зөвлөгөө, нарийн оношилгооны шинжилгээг аваарай. Манай мэргэжилтнүүд танд цогц тусламж үзүүлэхэд бэлэн байна.",
  },
  {
    title: "Дараах шинжилгээнүүдийг авч байна",
    text: "Мэргэшсэн эмчийн зөвлөгөө, нарийн оношилгооны шинжилгээг аваарай. Манай мэргэжилтнүүд танд цогц тусламж үзүүлэхэд бэлэн байна.",
  },
  {
    title: "Уламжлалтын эмчилгээ",
    text: "Мэргэшсэн эмчийн зөвлөгөө, нарийн оношилгооны шинжилгээг аваарай. Манай мэргэжилтнүүд танд цогц тусламж үзүүлэхэд бэлэн байна.",
  },
  {
    title: "Хүүхдийн эмчилгээ",
    text: "Мэргэшсэн эмчийн зөвлөгөө, нарийн оношилгооны шинжилгээг аваарай. Манай мэргэжилтнүүд танд цогц тусламж үзүүлэхэд бэлэн байна.",
  },
];

import { Microscope } from "lucide-react";

export const DIAGNOSTIC_SERVICES = [
  {
    icon: FlaskRound,
    title: "Бамбай булчирхайн үйл ажиллагаа",
    features: [
      "Чөлөөт Т3",
      "Чөлөөт Т4",
      "Бамбай идэвхжүүлэгч даавар",
      "Тиреоглобулины эсрэг бие",
      "Тиреод пероксидаза эсрэг бие",
    ],
  },

  {
    icon: TestTube,
    title: "Шээсний шинжилгээ ",
    features: [
      "Шээсний ерөнхий шинжилгээ",
      "Шээсний тунадасны шинжилгээ",
      "Бөөрний үйл ажиллагаа NGAL",
      ,
    ],
  },
  {
    icon: FlaskConical,
    title: "Биохимийн шинжилгээ",
    features: [
      "Эрдсийн багц+бөөрний үйл ажиллагаа",
      "Үрэвслийн уурагтай багц",
      "Таван цул эрхтэний үйл ажиллагааны багц",
      "3 сарын сахарын дундаж HbA1c - Глюкозжсон гемоглобинн гемоглобин",
      "Элэгний үйл ажиллагааны багц",
    ],
  },
  {
    icon: Radiation,
    title: "Хавдрын маркерын шинжилгээ",
    features: [
      "Элэгний хавдрын маркер",
      "Хөхний хавдрын маркер",
      "Өндгөвчний хавдрын маркер",
      "Нойр булчирхайн хавдрын маркер",
      "Ходоодны  хавдрын маркер",
      "Бүдүүн шулуун гэдэсний хавдрын маркер",
    ],
  },
  {
    icon: Droplet,
    title: "Цусны дэлгэрэнгүй шинжилгээ",
    features: [
      "Цусны дэлгэрэнгүй шинжилгээ",
      "Цус бүлэгнэлтийн багц шинжилгээ",
      "Д-Димер",
    ],
  },

  {
    icon: Sparkles,
    title: "Дааврын шинжилгээ",
    features: ["Эстрадиол", "Жирэмсний ХГ", "Прогестерон", "Тестостерон"],
  },
  {
    icon: HeartPulse,
    title: "Зүрхний үйл ажиллагааны шинжилгээ",
    features: [
      "Зүрхний шигдээсийн маркер",
      "Креатин киназа, зүрхний изофермент",
      "Зүрхний дутагдлын маркер",
    ],
  },

  {
    icon: Microscope,
    title: "Сериологийн шинжилгээ",
    features: [
      "ХДХВ /түргэвчилсэн/",
      "Тэмбүү /түргэвчилсэн/",
      "Томуу Flu A+B /түргэвчилсэн/",
    ],
  },
  {
    icon: Bone,
    title: "Үе мөчний шинжилгээ",
    features: ["Ц урвалжит уураг", "Үе мөчний үрэвслийн багц /түргэвчилсэн/"],
  },
  {
    icon: Bug,
    title: "Хеликобактери",
    features: ["Хеликобактери тоолох /өтгөнд/Эстрадиол"],
  },
  {
    icon: Microscope,
    title: "Бактериологийн шинжилгээ",
    features: ["Цагаан хорхойн шинжилгээ"],
  },
  {
    icon: Pill,
    title: "ВИТАМИН, ЭРДЭС, МИКРОЭЛЕМЕНТ",
    features: ["Эрдсийн багц", "Витамин Д тодорхойлох шинжилгээ "],
  },
  {
    icon: Worm,
    title: "Элэгний вирусын маркер илрүүлэх шинжилгээ ",
    features: [
      "Элэгний В вирус /анализатор/",
      "Элэгний В вирус /түргэвчилсэн/",
      "Элэгний С вирус /түргэвчилсэн/",
    ],
  },
];

import { Expert } from "../types/experts";
import Doctor1 from "./Odontuya.jpg";
import Doctor2 from "./Oyungerel.jpg";
import Doctor3 from "./Tungalag.png";
import Doctor4 from "./Amgalan.png";
import Doctor5 from "./Sambuu.jpg";

export const CONSULTATION_EXPERTS: Expert[] = [
  {
    name: "Д.ОДОНТУЯА эмч",
    experience: "Ажлын тушлага 42+",
    image: Doctor1,
    credentials:
      "АУ-ны  Доктор, Профессор, Зөвлөх эмч, МУ-ын эрүүлийг хамгаалахын гавьяат ажилтан",
    expertise: [
      "Үе мөчний өвчлөлүүд",
      "Зүрх судас- Дотоод шүүрэл",
      "Мэдрэлийн өвчин",
      "Хүүхдийн үзлэг, эмчилгээ",
      "Хөнгөвчлөхийн өвчний үзлэг эмчилгээ",
    ],
  },
  {
    name: "Р.ОЮУНГЭРЭЛ эмч",
    experience: "Ажлын тушлага 36+",
    image: Doctor2,
    credentials: "АУ-ны  Доктор, Дэд профессор, Зөвлөх эмч",
    expertise: ["Дотор", "Хүүхэд", "Халдварт өвч"],
  },
  {
    name: "Л.ТУНГАЛАГ эмч",
    experience: "Ажлын тушлага 31+",
    image: Doctor3,
    credentials: "АУ-ны  Доктор, Профессор, Хүүхдийн зөвлөх эмч",
    expertise: [
      "Нярайн өвөрмөц асаргаа, сувилал",
      "Нярайн асаргаа, хоололт",
      "Өсөлт хөгжил",
    ],
  },
  {
    name: "Б.АМГАЛАН эмч",
    experience: "Ажлын тушлага 23+",
    image: Doctor4,
    credentials: "АУ-ны  Доктор, Профессор, Зөвлөх эмч",
    expertise: ["Хүүхдийн мэдрэл", "Хүүхдийн сэтгэц", "Нярай"],
  },
  {
    name: "П.САМБУУЖАНЦАН эмч",
    experience: "Ажлын тушлага 33+",
    image: Doctor5,
    credentials: "Тэргүүлэх зэргийн эмч, клиникийн профессор",
    expertise: ["Зүрх судас", "Үе мөч", "Дотрын өвчлөлүүд"],
  },
];

export const CONTACTUS_CARD = [
  {
    icon: Phone,
    title: "Утас",
    text1: "Main: 7200-9898; 8888-6586",
    text2: "И-мэйл: info@entoclinic.mn",
  },
  {
    icon: MapPin,
    title: "Манай клиникийг зориорой",
    text1:
      "ЭНТО Клиник эмнэлэг БЗД, 26-р хороо, Хүннү гудамж, Кристал тауны замын урд талд,  HCC төвийн 3 давхарт 303,306 тоот",
  },
  {
    icon: Clock,
    title: "Цаг",
    text1: "Дав-Бям: 8:00 - 17:00",
    text2: "Бям: 9:00 - 15:00",
    text3: "Ням: Амарна",
  },
];

import image1 from "../asscents/shinjilgee.jpg";
import image2 from "../asscents/ulamjlalt or.jpg";
import image3 from "../asscents/childmedic.jpg";

export const SERVICES_CAROUSEL_INFO = [
  {
    href: "service/lab",
    icon: FlaskConical,
    image: image1,
    title: "Lab",
    text: "Манай клиникийг зориорой",
  },
  {
    href: "service/traditional-medicine",
    icon: Cross,
    image: image2,
    title: "Ulamjlalt",
    text: "Тэргүүлэх зэргийн эмч, клиникийн профессор",
  },
  {
    href: "service/child-medicine",
    icon: Baby,
    image: image3,
    title: "Huuhed",
    text: "Тэргүүлэх зэргийн эмч, клиникийн профессор",
  },
];

import TraditionalNidle from "../asscents/traditional-nidle.jpg";
import CuppingPicture from "../asscents/woman-experiencing-cupping-therapy.jpg";
import MassagePicture from "../asscents/top-view-patient-getting-cbd-treatment.jpg";

export const TRADITIONAL_INFO = [
  {
    text: [
      "Нүүрний саажилт засал зүү болон нүүрний бариа засал",
      "Мөнгөн зүү засал",
      "Турам зүү засал",
      "Гал зүү засал",
      "Тураах зүү засал",
    ],
    image: TraditionalNidle,
  },
  {
    text: [
      "Төөнүүр засал Бумба",
      "Галтай бумба ",
      "Зэс бумба",
      "Цахилгаан бумба",
      "Хануур засал",
      "Сам соруул засал",
    ],
    image: CuppingPicture,
  },
  {
    text: [
      "Махбодь, тамир тэнцвэржүүлэх суурь засал",
      "Махбодь, тамир тэнцвэржүүлэх суурь заслын багц",
      "Инфра улаан гэрлийн шарлага",
      "Халуун бигнүүр",
    ],
    image: MassagePicture,
  },
];

import DiagnosTreatment from "../asscents/5039740.jpg";
import DayCareChild from "../asscents/pediatrics_set_4.jpg";
import PhysicalTherapy from "../asscents/Family with kid visiting pediatrician flat vector illustration.jpg";
import CheckupPackage from "../asscents/pediatrician_5.jpg";

export const CHILD_MEDICINE_INFO = [
  {
    title: "Хүүхдийн өвчлөлийн оношилгоо, эмчилгээ",
    text: [
      "Хүүхдийн яаралтай тусламж",
      "Суурь эмгэг /сульдаа, тураал, цус багадал, диатез/-ийн оношилгоо эмчилгээний багц",
      "Амьсгалын эрхтэн тогтолцооны эмгэгүүд /ханиад шуухинаа, томуу, амьсгалын дээд ба доод замын өвчнүүд/-ийн оношилгоо эмчилгээний багц",
      "Хоол боловсруулах эрхтэн тогтолцооны эмгэгүүд /амны хөндийн өвчнүүд, ходоод гэдэсний үйлийн хямрал, биж, суулгалт, шимэгч хорхой/-ийн оношилгоо эмчилгээний багц",
      "Хүүхдийн бусад түгээмэл тохиоддог эмгэгүүдийн оношилгоо эмчилгээний багц",
    ],
    image: DiagnosTreatment,
  },
  {
    title: "Хүүхдийн өдрийн эмчилгээний төрлүүд",
    text: [
      "Амьсгалын замын өвчлөлийн эмчилгээний багц",
      "Суулгалт өвчний эмчилгээний багц",
      "Хордлого тайлах эмчилгээний багц",
      "Дархлаа дэмжих эмчилгээний багц",
      "Мөөгөнцрийн өвчний эмчилгээний багц",
      "Нярайн шарлалт өвчний оношилгоо, эмчилгээний багц",
      "Нярайн хоол боловсруулах эрхтний хямралын оношилгоо эмчилгээний багц",
      "Нярайн асаргаа сувилгааны багц",
      "Хүүхдийн яаралтай тусламж үйлчилгээ",
    ],
    image: DayCareChild,
  },
  {
    title: "Хүүхдийн тусламжид хийгдэх физик эмчилгээнүүд",
    text: [
      "Фото эмчилгээ",
      "Утлага эммчилгээ",
      "УФО шарлага",
      "УВЧ шарлага",
      "Бумба эмчилгээ",
      "Хүчилтөрөгч эмчилгээ",
      "Шулуун гэдсээр клизм тавих",
      "Доргиох иллэг",
      "Халуун бууруулах жин тавих",
      "Цэр соруулах",
      "Хамар угааж цэвэрлэх",
      "Ам цэвэрлэх",
    ],
    image: PhysicalTherapy,
  },
  {
    title: "Хүүхдийн урьдчилан сэргийлэх үзлэгийн багц",
    text: [
      "Яс, эрдсийн корпорейт багц",
      "Өсвөр насны хүүхдийн суурь өвчин илрүүлэх багц",
      "Бага насны хүүхдийн суурь өвчин илрүүлэх багц",
      " Хоол тэжээлийн дутагдал үнэлэх багц",
      "Цус багадалыг илрүүлэх багц",
      "Сульдаа (рахит) өвчнийг илрүүлэх багц",
      "Хүүхдийн бөөрний өвчлөл илрүүлэх багц",
      "Бассейн багц",
      "Цэцэрлэгийн багц",
      "Сурагч багц",
    ],
    image: CheckupPackage,
  },
];
